class ANAL;
struct Vtbl;
struct Vec4;
struct Vec3;
struct LinearTransform;
struct Mat3;
struct Vec2;
struct Vec3d;

//-------------------------------------

class ANAL // size: 0x1360
{
public:
	ANAL* _000; 	// 0x000
	ANAL* _001; 	// 0x004
	ANAL* _002; 	// 0x008
	ANAL* _003; 	// 0x00C
	ANAL* _004; 	// 0x010
	ANAL* _005; 	// 0x014
	ANAL* _006; 	// 0x018
	ANAL* _007; 	// 0x01C
	ANAL* _008; 	// 0x020
	ANAL* _009; 	// 0x024
	ANAL* _010; 	// 0x028
	ANAL* _011; 	// 0x02C
	ANAL* _012; 	// 0x030
	ANAL* _013; 	// 0x034
	ANAL* _014; 	// 0x038
	ANAL* _015; 	// 0x03C
	ANAL* _016; 	// 0x040
	ANAL* _017; 	// 0x044
	ANAL* _018; 	// 0x048
	ANAL* _019; 	// 0x04C
	ANAL* _020; 	// 0x050
	ANAL* _021; 	// 0x054
	ANAL* _022; 	// 0x058
	ANAL* _023; 	// 0x05C
	ANAL* _024; 	// 0x060
	ANAL* _025; 	// 0x064
	ANAL* _026; 	// 0x068
	ANAL* _027; 	// 0x06C
	ANAL* _028; 	// 0x070
	ANAL* _029; 	// 0x074
	ANAL* _030; 	// 0x078
	ANAL* _031; 	// 0x07C
	ANAL* _032; 	// 0x080
	ANAL* _033; 	// 0x084
	ANAL* _034; 	// 0x088
	ANAL* _035; 	// 0x08C
	ANAL* _036; 	// 0x090
	ANAL* _037; 	// 0x094
	ANAL* _038; 	// 0x098
	ANAL* _039; 	// 0x09C
	ANAL* _040; 	// 0x0A0
	ANAL* _041; 	// 0x0A4
	ANAL* _042; 	// 0x0A8
	ANAL* _043; 	// 0x0AC
	ANAL* _044; 	// 0x0B0
	ANAL* _045; 	// 0x0B4
	ANAL* _046; 	// 0x0B8
	ANAL* _047; 	// 0x0BC
	ANAL* _048; 	// 0x0C0
	ANAL* _049; 	// 0x0C4
	ANAL* _050; 	// 0x0C8
	ANAL* _051; 	// 0x0CC
	ANAL* _052; 	// 0x0D0
	ANAL* _053; 	// 0x0D4
	ANAL* _054; 	// 0x0D8
	ANAL* _055; 	// 0x0DC
	ANAL* _056; 	// 0x0E0
	ANAL* _057; 	// 0x0E4
	ANAL* _058; 	// 0x0E8
	ANAL* _059; 	// 0x0EC
	ANAL* _060; 	// 0x0F0
	ANAL* _061; 	// 0x0F4
	ANAL* _062; 	// 0x0F8
	ANAL* _063; 	// 0x0FC
	ANAL* _064; 	// 0x100
	ANAL* _065; 	// 0x104
	ANAL* _066; 	// 0x108
	ANAL* _067; 	// 0x10C
	ANAL* _068; 	// 0x110
	ANAL* _069; 	// 0x114
	ANAL* _070; 	// 0x118
	ANAL* _071; 	// 0x11C
	ANAL* _072; 	// 0x120
	ANAL* _073; 	// 0x124
	ANAL* _074; 	// 0x128
	ANAL* _075; 	// 0x12C
	ANAL* _076; 	// 0x130
	ANAL* _077; 	// 0x134
	ANAL* _078; 	// 0x138
	ANAL* _079; 	// 0x13C
	ANAL* _080; 	// 0x140
	ANAL* _081; 	// 0x144
	ANAL* _082; 	// 0x148
	ANAL* _083; 	// 0x14C
	ANAL* _084; 	// 0x150
	ANAL* _085; 	// 0x154
	ANAL* _086; 	// 0x158
	ANAL* _087; 	// 0x15C
	ANAL* _088; 	// 0x160
	ANAL* _089; 	// 0x164
	ANAL* _090; 	// 0x168
	ANAL* _091; 	// 0x16C
	ANAL* _092; 	// 0x170
	ANAL* _093; 	// 0x174
	ANAL* _094; 	// 0x178
	ANAL* _095; 	// 0x17C
	ANAL* _096; 	// 0x180
	ANAL* _097; 	// 0x184
	ANAL* _098; 	// 0x188
	ANAL* _099; 	// 0x18C
	ANAL* _100; 	// 0x190
	ANAL* _101; 	// 0x194
	ANAL* _102; 	// 0x198
	ANAL* _103; 	// 0x19C
	ANAL* _104; 	// 0x1A0
	ANAL* _105; 	// 0x1A4
	ANAL* _106; 	// 0x1A8
	ANAL* _107; 	// 0x1AC
	ANAL* _108; 	// 0x1B0
	ANAL* _109; 	// 0x1B4
	ANAL* _110; 	// 0x1B8
	ANAL* _111; 	// 0x1BC
	ANAL* _112; 	// 0x1C0
	ANAL* _113; 	// 0x1C4
	ANAL* _114; 	// 0x1C8
	ANAL* _115; 	// 0x1CC
	ANAL* _116; 	// 0x1D0
	ANAL* _117; 	// 0x1D4
	ANAL* _118; 	// 0x1D8
	ANAL* _119; 	// 0x1DC
	ANAL* _120; 	// 0x1E0
	ANAL* _121; 	// 0x1E4
	ANAL* _122; 	// 0x1E8
	ANAL* _123; 	// 0x1EC
	ANAL* _124; 	// 0x1F0
	ANAL* _125; 	// 0x1F4
	ANAL* _126; 	// 0x1F8
	ANAL* _127; 	// 0x1FC
	ANAL* _128; 	// 0x200
	ANAL* _129; 	// 0x204
	ANAL* _130; 	// 0x208
	ANAL* _131; 	// 0x20C
	ANAL* _132; 	// 0x210
	ANAL* _133; 	// 0x214
	ANAL* _134; 	// 0x218
	ANAL* _135; 	// 0x21C
	ANAL* _136; 	// 0x220
	ANAL* _137; 	// 0x224
	ANAL* _138; 	// 0x228
	ANAL* _139; 	// 0x22C
	ANAL* _140; 	// 0x230
	ANAL* _141; 	// 0x234
	ANAL* _142; 	// 0x238
	ANAL* _143; 	// 0x23C
	ANAL* _144; 	// 0x240
	ANAL* _145; 	// 0x244
	ANAL* _146; 	// 0x248
	ANAL* _147; 	// 0x24C
	ANAL* _148; 	// 0x250
	ANAL* _149; 	// 0x254
	ANAL* _150; 	// 0x258
	ANAL* _151; 	// 0x25C
	ANAL* _152; 	// 0x260
	ANAL* _153; 	// 0x264
	ANAL* _154; 	// 0x268
	ANAL* _155; 	// 0x26C
	ANAL* _156; 	// 0x270
	ANAL* _157; 	// 0x274
	ANAL* _158; 	// 0x278
	ANAL* _159; 	// 0x27C
	ANAL* _160; 	// 0x280
	ANAL* _161; 	// 0x284
	ANAL* _162; 	// 0x288
	ANAL* _163; 	// 0x28C
	ANAL* _164; 	// 0x290
	ANAL* _165; 	// 0x294
	ANAL* _166; 	// 0x298
	ANAL* _167; 	// 0x29C
	ANAL* _168; 	// 0x2A0
	ANAL* _169; 	// 0x2A4
	ANAL* _170; 	// 0x2A8
	ANAL* _171; 	// 0x2AC
	ANAL* _172; 	// 0x2B0
	ANAL* _173; 	// 0x2B4
	ANAL* _174; 	// 0x2B8
	ANAL* _175; 	// 0x2BC
	ANAL* _176; 	// 0x2C0
	ANAL* _177; 	// 0x2C4
	ANAL* _178; 	// 0x2C8
	ANAL* _179; 	// 0x2CC
	ANAL* _180; 	// 0x2D0
	ANAL* _181; 	// 0x2D4
	ANAL* _182; 	// 0x2D8
	ANAL* _183; 	// 0x2DC
	ANAL* _184; 	// 0x2E0
	ANAL* _185; 	// 0x2E4
	ANAL* _186; 	// 0x2E8
	ANAL* _187; 	// 0x2EC
	ANAL* _188; 	// 0x2F0
	ANAL* _189; 	// 0x2F4
	ANAL* _190; 	// 0x2F8
	ANAL* _191; 	// 0x2FC
	ANAL* _192; 	// 0x300
	ANAL* _193; 	// 0x304
	ANAL* _194; 	// 0x308
	ANAL* _195; 	// 0x30C
	ANAL* _196; 	// 0x310
	ANAL* _197; 	// 0x314
	ANAL* _198; 	// 0x318
	ANAL* _199; 	// 0x31C
	UCHAR unknown_320[4160]; 	// 0x320
};

struct Vtbl // size: 0x004
{
	ANAL* vtf; 	// 0x000
};

struct Vec4 // size: 0x010
{
	float x; 	// 0x000
	float y; 	// 0x004
	float z; 	// 0x008
	float w; 	// 0x00C
};

struct Vec3 // size: 0x00C
{
	float x; 	// 0x000
	float y; 	// 0x004
	float z; 	// 0x008
};

struct LinearTransform // size: 0x040
{
	Vec4 left; 	// 0x000
	Vec4 up; 	// 0x010
	Vec4 forward; 	// 0x020
	Vec4 trans; 	// 0x030
};

struct Mat3 // size: 0x030
{
	Vec4 left; 	// 0x000
	Vec4 up; 	// 0x010
	Vec4 forward; 	// 0x020
};

struct Vec2 // size: 0x008
{
	float x; 	// 0x000
	float y; 	// 0x004
};

struct Vec3d // size: 0x018
{
	double x; 	// 0x000
	double y; 	// 0x008
	double z; 	// 0x010
};


